**PANDAS**

In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\91628\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\91628\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91628\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\91628\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\91628\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\91628\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
#series - 1d array

s = pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#creating dataframe

course = {"course name" : ['python','ds','da'] , "no of courses" : [20,18,22]}
df = pd.DataFrame(course)
print(df)

  course name  no of courses
0      python             20
1          ds             18
2          da             22

In [5]:
#reading file

#from google.colab import files

#uploaded = files.upload()

ModuleNotFoundError: No module named 'google'

In [6]:
df = pd.read_excel("GB.xlsx")

In [7]:
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Postal Code,City,...,Order Priority,Unit Price,Cost,sales staus,sum,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32
0,40098,CA-2014-AB10015140-41954,41954,41956,879879,AB-100151402,Aaron Bergman,Consumer,73120.0,Oklahoma City,...,High,496,4030.1544,True,1.264250e+07,246.490581,8399.976,-6599.978,51290.0,Phones Samsung Convoy 3
1,26341,IN-2014-JR162107-41675,41675,41677,Second Class,JR-162107,Justin Ritter,Corporate,NaN,Wollongong,...,Critical,23,6.2350,True,1.264228e+07,246.491059,NaN,NaN,NaN,Ph
2,25330,IN-2014-CR127307-41929,41929,41930,First Class,CR-127307,Craig Reiter,Consumer,NaN,Brisbane,...,Medium,215,3770.4610,True,1.263857e+07,246.423540,NaN,NaN,NaN,rs
3,13524,ES-2014-KM1637548-41667,41667,41669,First Class,KM-1637548,Katherine Murray,Home Office,NaN,Berlin,...,Medium,364,2633.6200,True,1.263340e+07,246.327439,NaN,NaN,NaN,es
4,47221,SG-2014-RH9495111-41948,41948,41949,Same Day,RH-9495111,Rick Hansen,Consumer,NaN,Dakar,...,Critical,26,1422.5600,True,1.263050e+07,246.275842,NaN,NaN,NaN,es

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51290 entries, 0 to 51289
Data columns (total 33 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          51290 non-null  int64
 1   Order ID        51290 non-null  object
 2   Order Date      51290 non-null  int64
 3   Ship Date       51290 non-null  int64
 4   Ship Mode       51290 non-null  object
 5   Customer ID     51290 non-null  object
 6   Customer Name   51290 non-null  object
 7   Segment         51290 non-null  object
 8   Postal Code     9994 non-null   float64
 9   City            51290 non-null  object
 10  State           51290 non-null  object
 11  Country         51290 non-null  object
 12  Region          51283 non-null  object
 13  Market          51290 non-null  object
 14  Product ID      51290 non-null  object
 15  Category        51290 non-null  object
 16  Sub-Category    51290 non-null  object
 17  Product Name    51290 non-null  object
 18  Sales           51290 non-null  float64
 19  Quantity        51290 non-null  int64
 20  Discount        51290 non-null  float64
 21  Profit          51290 non-null  float64
 22  Shipping Cost   51289 non-null  float64
 23  Order Priority  51290 non-null  object
 24  Unit Price      51290 non-null  int64
 25  Cost            51290 non-null  float64
 26  sales staus     51290 non-null  bool
 27  sum             51290 non-null  float64
 28  Unnamed: 28     51290 non-null  float64
 29  Unnamed: 29     1 non-null      float64
 30  Unnamed: 30     1 non-null      float64
 31  Unnamed: 31     1 non-null      float64
 32  Unnamed: 32     51290 non-null  object
dtypes: bool(1), float64(11), int64(5), object(16)
memory usage: 12.6+ MB

In [9]:
#grouping  by

group = df.groupby("Segment")["Unit Price"].max()
print(group)

Segment
Consumer       550
Corporate      550
Home Office    550
Name: Unit Price, dtype: int64

In [10]:
group = df.groupby("Segment")["Unit Price"].min()
print(group)

Segment
Consumer       1
Corporate      1
Home Office    1
Name: Unit Price, dtype: int64

In [11]:
# Calculate aggregation function at one time using 'agg' method

agg = df.groupby('Segment').agg({'Unit Price' : ['sum','max','min','mean']})
print(agg)

            Unit Price
                   sum  max min        mean
Segment
Consumer       7294175  550   1  275.065050
Corporate      4265295  550   1  276.446626
Home Office    2548608  550   1  272.782618

In [12]:
#merge data

dfs = pd.DataFrame({'Name':['lasya','janu','sai'], 'city':['Hyd','Tpt','Cn']})
print(dfs)

    Name city
0  lasya  Hyd
1   janu  Tpt
2    sai   Cn

In [13]:
#merge data

df1 = pd.DataFrame({'Name':['kutti','nani','sai'], 'city':['Vij','Tpt','Cn']})
print(df1)

    Name city
0  kutti  Vij
1   nani  Tpt
2    sai   Cn

In [14]:
#concating using pandas concat

df2 = [dfs,df1]
merge = pd.concat(df2)
print(merge)

    Name city
0  lasya  Hyd
1   janu  Tpt
2    sai   Cn
0  kutti  Vij
1   nani  Tpt
2    sai   Cn

DATA *CLEANING*

In [15]:
df.isnull().sum()

Row ID                0
Order ID              0
Order Date            0
Ship Date             0
Ship Mode             0
Customer ID           0
Customer Name         0
Segment               0
Postal Code       41296
City                  0
State                 0
Country               0
Region                7
Market                0
Product ID            0
Category              0
Sub-Category          0
Product Name          0
Sales                 0
Quantity              0
Discount              0
Profit                0
Shipping Cost         1
Order Priority        0
Unit Price            0
Cost                  0
sales staus           0
sum                   0
Unnamed: 28           0
Unnamed: 29       51289
Unnamed: 30       51289
Unnamed: 31       51289
Unnamed: 32           0
dtype: int64

In [16]:
df.isnull().any()

Row ID            False
Order ID          False
Order Date        False
Ship Date         False
Ship Mode         False
Customer ID       False
Customer Name     False
Segment           False
Postal Code        True
City              False
State             False
Country           False
Region             True
Market            False
Product ID        False
Category          False
Sub-Category      False
Product Name      False
Sales             False
Quantity          False
Discount          False
Profit            False
Shipping Cost      True
Order Priority    False
Unit Price        False
Cost              False
sales staus       False
sum               False
Unnamed: 28       False
Unnamed: 29        True
Unnamed: 30        True
Unnamed: 31        True
Unnamed: 32       False
dtype: bool

In [17]:
df.fillna(0,inplace = True)

In [18]:
df.duplicated() #if any duplicates

0        False
1        False
2        False
3        False
4        False
         ...
51285    False
51286    False
51287    False
51288    False
51289    False
Length: 51290, dtype: bool

In [19]:
#renaming the columns

df = df.rename(columns={'Order Date' : 'Odate' , 'Ship Date' : 'Sdate' })
df.head()

,Row ID,Order ID,Odate,Sdate,Ship Mode,Customer ID,Customer Name,Segment,Postal Code,City,...,Order Priority,Unit Price,Cost,sales staus,sum,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32
0,40098,CA-2014-AB10015140-41954,41954,41956,879879,AB-100151402,Aaron Bergman,Consumer,73120.0,Oklahoma City,...,High,496,4030.1544,True,1.264250e+07,246.490581,8399.976,-6599.978,51290.0,Phones Samsung Convoy 3
1,26341,IN-2014-JR162107-41675,41675,41677,Second Class,JR-162107,Justin Ritter,Corporate,0.0,Wollongong,...,Critical,23,6.2350,True,1.264228e+07,246.491059,0.000,0.000,0.0,Ph
2,25330,IN-2014-CR127307-41929,41929,41930,First Class,CR-127307,Craig Reiter,Consumer,0.0,Brisbane,...,Medium,215,3770.4610,True,1.263857e+07,246.423540,0.000,0.000,0.0,rs
3,13524,ES-2014-KM1637548-41667,41667,41669,First Class,KM-1637548,Katherine Murray,Home Office,0.0,Berlin,...,Medium,364,2633.6200,True,1.263340e+07,246.327439,0.000,0.000,0.0,es
4,47221,SG-2014-RH9495111-41948,41948,41949,Same Day,RH-9495111,Rick Hansen,Consumer,0.0,Dakar,...,Critical,26,1422.5600,True,1.263050e+07,246.275842,0.000,0.000,0.0,es